# generating higher dataframe

In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [28]:
list1='g1 g1 g1 g2 g2 g2 g3 g3 g3'.split()
num=[1,2,3,1,2,3,4,5]
higher_index=list(zip(list1,num))
higher_index=pd.MultiIndex.from_tuples(higher_index)

In [29]:
list(zip(list1,num))

[('g1', 1),
 ('g1', 2),
 ('g1', 3),
 ('g2', 1),
 ('g2', 2),
 ('g2', 3),
 ('g3', 4),
 ('g3', 5)]

In [30]:
higher_index

MultiIndex(levels=[['g1', 'g2', 'g3'], [1, 2, 3, 4, 5]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2], [0, 1, 2, 0, 1, 2, 3, 4]])

In [32]:
df=pd.DataFrame(randn(8,3),higher_index,['A','B','C'])

In [33]:
df

             A         B         C
g1 1 -0.205840  0.305632  0.760641
   2  1.872173  0.053364 -0.712753
   3 -0.229610 -0.682765 -0.384674
g2 1  0.271142  0.907118 -1.756780
   2 -0.146391  1.100974  0.204274
   3 -0.033431  0.372258 -0.041002
g3 4  0.709272  0.304048 -0.167298
   5  0.381775  0.489103  0.176755

In [48]:
df.loc['g1']

          A         B         C
1  0.631681 -1.065512 -0.320707
2  2.092894 -0.237484 -0.160711
3  1.642589  0.942599  0.774860

In [59]:
df.loc['g1'].loc[1]   # is similar to the df.iloc[0]

A    0.631681
B   -1.065512
C   -0.320707
Name: 1, dtype: float64

In [60]:
df.loc['g1'].loc[2]   #is simillar to df.iloc[1]

A    2.092894
B   -0.237484
C   -0.160711
Name: 2, dtype: float64

In [61]:
df.loc['g2'].loc[1]   # is similar to the df.iloc[4]

A    0.506244
B   -0.319918
C    2.121185
Name: 1, dtype: float64

In [68]:
df.index.names=['GROUPS','NUM']
df

                   A         B         C
GROUPS NUM
g1     1    0.631681 -1.065512 -0.320707
       2    2.092894 -0.237484 -0.160711
       3    1.642589  0.942599  0.774860
g2     1    0.506244 -0.319918  2.121185
       2    1.291517 -0.262202 -0.287461
       3   -0.098013 -0.388975  0.060477

In [69]:
df.xs('g1')  # with the help of the xs method we can get the data without main row names

            A         B         C
NUM
1    0.631681 -1.065512 -0.320707
2    2.092894 -0.237484 -0.160711
3    1.642589  0.942599  0.774860

In [70]:
df.xs(1,level='NUM')

               A         B         C
GROUPS
g1      0.631681 -1.065512 -0.320707
g2      0.506244 -0.319918  2.121185

# missing data

In [3]:
d={'A':[1,2,np.NaN],'B':[3,np.NaN,np.NaN],'C':[4,5,np.NaN]}
dd=pd.DataFrame(d)
dd

     A    B    C
0  1.0  3.0  4.0
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [7]:
dd.index.names=['index']
dd

         A    B    C
index
0      1.0  3.0  4.0
1      2.0  NaN  5.0
2      NaN  NaN  NaN

In [8]:
dd.dropna()  # to return a rows which don't have nan objects

         A    B    C
index
0      1.0  3.0  4.0

In [10]:
dd.dropna(axis=1)    # returns a columns which don't have nan objects. in this example it doesn't return a column .

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [18]:
dd.dropna(thresh=3)

         A    B    C
index
0      1.0  3.0  4.0

In [22]:
dd.fillna(value=dd['A'].mean())  # to fill the nan objects with the argument value

         A    B    C
index
0      1.0  3.0  4.0
1      2.0  1.5  5.0
2      1.5  1.5  1.5

In [23]:
dd

         A    B    C
index
0      1.0  3.0  4.0
1      2.0  NaN  5.0
2      NaN  NaN  NaN

In [25]:
dd['A'].fillna(value=3)  # to fill the nan objects with the argument value

index
0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [4]:
dd  # check

     A    B    C
0  1.0  3.0  4.0
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [7]:
check=dd['A'].isnull()
dd[check]              # returns a true column

    A   B   C
2 NaN NaN NaN

In [9]:
dd.isnull().sum()     # returns total count of NaN values in the columns

A    1
B    2
C    1
dtype: int64

In [12]:
dd.duplicated(keep='last')   # to find duplicate data
                             # here we don't have duplicate data so we got false

0    False
1    False
2    False
dtype: bool

-> to select duplicate columns in the data, 
    syntax is :-df.duplicated(['column_name','column_name' ])